Revit 2026 API

# RevitLinkTypeGetTopLevelLink(Document, ModelPath) Method

---

Returns the ElementId of the (top-level) linked model with the given path.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElementId GetTopLevelLink(
	Document document,
	ModelPath path
)
```
```vb
Public Shared Function GetTopLevelLink (
	document As Document,
	path As ModelPath
) As ElementId
```
```cpp
public:
static ElementId^ GetTopLevelLink(
	Document^ document,
	ModelPath^ path
)
```
```fsharp
static member GetTopLevelLink :
        document : Document *
        path : ModelPath -> ElementId
```

#### Parameters

document Document
     The document to look for the linked model in.
path ModelPath
     A path indicating which linked model to return.

#### Return Value

ElementId The id of the link with the given path, or InvalidElementId if there is no top-level link at that path.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function will not return nested links.

#### Reference

RevitLinkType Class

GetTopLevelLink Overload

Autodesk.Revit.DB Namespace